// 1. Створити функцію, яка прийматиме на вхід масив.
//
//      Кожен із елементів масиву вивести на сторінку у вигляді пункту списку
//      Додайте кожному елементу дата атрибут position який дорівнює індексу елемента в масиві
//      Необхідно використовувати шаблонні рядки та функцію map масиву для формування контенту списку перед виведенням його на сторінку.
//      Додати розмітку у div з айді root
//      Приклади масивів, які можна виводити на екран:
//      ['hello', 'world', 'Kiev', 'Kharkiv', 'Odessa', 'Lviv']
//      ['1', '2', '3', 'sea', 'user', 23]

// 2. Додати обробник подій пілся того, як відобразали список.
//    Обробник має при кліку або додавати на єлемент списку класс active або прибирати

// 3. Зробити так, щоб активний елемент списку був зажди тільки один. Якщо клікнули на неактивний елемент списку і при
//    цбому на сторінці вже є активний елемент – прибирати класс active у існуючого активного елемента
